app/controllers/gitgems_controller.rb

  def index
    @gitgems = Gitgem.all
---
SELECT "gitgems".* FROM "gitgems"

  def show
    @gitgem = Gitgem.find(params[:id])
---
SELECT "gitgems".* FROM "gitgems" WHERE "gitgems"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @gitgem = Gitgem.new(params[:gitgem])

    respond_to do |format|
      if @gitgem.save
---
INSERT INTO "gitgems" ("created_at", "description", "name", "updated_at", "version") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sun, 20 Jan 2013 11:28:04 UTC +00:00], ["description", "Used for generating pdf's"], ["name", "Prawn"], ["updated_at", Sun, 20 Jan 2013 11:28:04 UTC +00:00], ["version", "latest"]]